In [1]:
import sqlalchemy as sa
from urllib.parse import quote_plus
import os
#!pip install mysqlclient
import pandas as pd

In [2]:
user = os.environ.get('DB_USER')
password = quote_plus(os.environ.get('DB_PASSWORD'))
host = os.environ.get('DB_HOST')
database = 'LEARNING_HR'
engine_arg = f"mysql+mysqldb://{user}:{password}@{host}/{database}?charset=utf8mb4"
connecting_string = f"mysql://{user}:{password}@{host}/{database}"
print(engine_arg)

db = sa.create_engine(engine_arg)
conn = db.connect()

mysql+mysqldb://root:password123%21%40%23ABC@127.0.0.1/LEARNING_HR?charset=utf8mb4

In [3]:
%load_ext sql
%sql $connecting_string

In [14]:
%sql create view EMPYSALARY as \
    select EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY \
        from EMPLOYEES;

 * mysql://root:***@127.0.0.1/LEARNING_HR
0 rows affected.

[]

In [15]:
%sql select * from EMPYSALARY

 * mysql://root:***@127.0.0.1/LEARNING_HR
10 rows affected.

[('E1001', 'John', 'Thomas', datetime.date(1976, 9, 1), 'M', Decimal('100000.00')),
 ('E1002', 'Alice', 'James', datetime.date(1972, 7, 31), 'F', Decimal('80000.00')),
 ('E1003', 'Steve', 'Wells', datetime.date(1980, 10, 8), 'M', Decimal('50000.00')),
 ('E1004', 'Santosh', 'Kumar', datetime.date(1985, 7, 20), 'M', Decimal('60000.00')),
 ('E1005', 'Ahmed', 'Hussain', datetime.date(1981, 4, 1), 'M', Decimal('70000.00')),
 ('E1006', 'Nancy', 'Allen', datetime.date(1978, 6, 2), 'F', Decimal('90000.00')),
 ('E1007', 'Mary', 'Thomas', datetime.date(1975, 5, 5), 'F', Decimal('65000.00')),
 ('E1008', 'Bharath', 'Gupta', datetime.date(1985, 6, 5), 'M', Decimal('65000.00')),
 ('E1009', 'Andrea', 'Jones', datetime.date(1990, 9, 7), 'F', Decimal('70000.00')),
 ('E1010', 'Ann', 'Jacob', datetime.date(1982, 3, 30), 'F', Decimal('70000.00'))]

In [19]:
%sql create or replace view EMPSALARY as \
    select EMP_ID, F_NAME, L_NAME, B_DATE, SEX, JOB_TITLE, MIN_SALARY, MAX_SALARY \
    from EMPLOYEES, JOBS \
    where EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;

%sql select * from EMPSALARY

 * mysql://root:***@127.0.0.1/LEARNING_HR

0 rows affected.
 * mysql://root:***@127.0.0.1/LEARNING_HR
10 rows affected.

[('E1001', 'John', 'Thomas', datetime.date(1976, 9, 1), 'M', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('E1002', 'Alice', 'James', datetime.date(1972, 7, 31), 'F', 'Sr. Software Developer', Decimal('60000.00'), Decimal('80000.00')),
 ('E1003', 'Steve', 'Wells', datetime.date(1980, 10, 8), 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1004', 'Santosh', 'Kumar', datetime.date(1985, 7, 20), 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1005', 'Ahmed', 'Hussain', datetime.date(1981, 4, 1), 'M', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('E1006', 'Nancy', 'Allen', datetime.date(1978, 6, 2), 'F', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('E1007', 'Mary', 'Thomas', datetime.date(1975, 5, 5), 'F', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1008', 'Bharath', 'Gupta', datetime.date(1985, 6, 5), 'M', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1009', 'Andrea', 'Jones', datetime.date(1990, 9, 7), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('E1010', 'Ann', 'Jacob', datetime.date(1982, 3, 30), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))]

In [18]:
%sql DROP VIEW EMPYSALARY;

 * mysql://root:***@127.0.0.1/LEARNING_HR
0 rows affected.

[]

In [22]:
## PP1. Create a view “EMP_DEPT” which has the following information.
%sql create view EMP_DEPT as \
    select EMP_ID, F_NAME, L_NAME , DEP_ID from EMPLOYEES

%sql select * from EMP_DEPT

 * mysql://root:***@127.0.0.1/LEARNING_HR
0 rows affected.
 * mysql://root:***@127.0.0.1/LEARNING_HR
10 rows affected.

[('E1001', 'John', 'Thomas', '2'),
 ('E1002', 'Alice', 'James', '5'),
 ('E1003', 'Steve', 'Wells', '5'),
 ('E1004', 'Santosh', 'Kumar', '5'),
 ('E1005', 'Ahmed', 'Hussain', '2'),
 ('E1006', 'Nancy', 'Allen', '2'),
 ('E1007', 'Mary', 'Thomas', '7'),
 ('E1008', 'Bharath', 'Gupta', '7'),
 ('E1009', 'Andrea', 'Jones', '7'),
 ('E1010', 'Ann', 'Jacob', '5')]

In [25]:
##PP2. Modify “EMP_DEPT” such that it displays Department names instead of Department IDs. For this, we need to combine information from EMPLOYEES and DEPARTMENTS as follows.
%sql create or replace view EMP_DEPT as \
    select emp.EMP_ID, emp.F_NAME, emp.L_NAME, dep.DEP_NAME from EMPLOYEES emp, DEPARTMENTS dep \
        where emp.DEP_ID = dep.DEPT_ID_DEP;

%sql select * from EMP_DEPT

 * mysql://root:***@127.0.0.1/LEARNING_HR
0 rows affected.
 * mysql://root:***@127.0.0.1/LEARNING_HR
10 rows affected.

[('E1001', 'John', 'Thomas', 'Architect Group'),
 ('E1002', 'Alice', 'James', 'Software Group'),
 ('E1003', 'Steve', 'Wells', 'Software Group'),
 ('E1004', 'Santosh', 'Kumar', 'Software Group'),
 ('E1005', 'Ahmed', 'Hussain', 'Architect Group'),
 ('E1006', 'Nancy', 'Allen', 'Architect Group'),
 ('E1007', 'Mary', 'Thomas', 'Design Team'),
 ('E1008', 'Bharath', 'Gupta', 'Design Team'),
 ('E1009', 'Andrea', 'Jones', 'Design Team'),
 ('E1010', 'Ann', 'Jacob', 'Software Group')]

In [27]:
conn.close()
db.dispose()